:PROPERTIES:
:ID:       33B0C1A7-3CCE-46A3-90FE-71AE25517A15
:ROAM_ALIASES: nix-config
:header-args: :eval no
:END:
#+title: Nix configuration
#+author: Jeff Kreeftmeijer
#+options: toc:2

#+include: ./nix-home-manager.org

** direnv

[[https://direnv.net][Direnv]] loads and unloads packages based on the curent directory to create per-project development environments.

#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports both
#+begin_src shell
  direnv --version
#+end_src

#+RESULTS[76c6f95454c8be913fe23f78d4d384d057d77744]:
: 2.32.2

** emacs

Emacs, built from source from the master branch:

#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports both
#+headers: :results text
#+begin_src emacs-lisp
  (concat
   "GNU Emacs "
   emacs-version
   " (" emacs-repository-branch " @ " emacs-repository-version ")")
#+end_src

#+RESULTS[d0a28aa425cae94a5b9f635388232d20669dc8f9]:
: GNU Emacs 30.0.50 (master @ dec09aaeb616e7648f4694d76090cc8e269471e0)

My current version was built with the following options:[fn:prefix]

[fn:prefix]In reality, Nix also sets a =--prefix= because it installs Emacs in a custom location, like =/nix/store/x6nsbfr31nphxzn2f9c8iyc66rxvmi7d-emacs-git-20230321.0=.
I consider that a Nix artifact, and not an Emacs configuration setting.

Another option I did include above is =--disable-build-details=, which is also set by Nix [[https://github.com/NixOS/nixpkgs/commit/496f9309480b22173e25885bc7c128c30fbd4da3][for a more reproducable build]].
In practice, that means the host names and build times are omitted from the built program to keep its hash stable for Nix's cache.


#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports results
#+headers: :wrap src shell
#+begin_src emacs-lisp
  (concat "./configure "
	  (string-join (cdr (split-string system-configuration-options " "))
		       " \\\n"))
#+end_src

#+RESULTS[fbd71416735eb4da4353bed18d840e3a2718b2cb]:
#+begin_src shell
./configure --disable-build-details \
--with-modules \
--with-ns \
--disable-ns-self-contained \
--with-native-compilation
#+end_src

This produces a build with the following features enabled:

#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports results
#+begin_src emacs-lisp
system-configuration-features
#+end_src

#+RESULTS[35cf9621cff446642956b65406a2f88c92d2d0c5]:
: ACL GLIB GMP GNUTLS JPEG JSON LIBXML2 MODULES NATIVE_COMP NOTIFY KQUEUE NS PDUMPER PNG RSVG SQLITE3 THREADS TIFF TOOLKIT_SCROLL_BARS TREE_SITTER WEBP ZLIB

** git

#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports both
#+begin_src shell
  git --version
#+end_src

#+RESULTS[ea1662b458130df3688c79b48d34eb0215cc65b0]:
: git version 2.39.2

** gpg

#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports both
#+headers: :results scalar
#+begin_src shell
  gpg --version
#+end_src

#+RESULTS[136aaccd7203d32f62d31020ecd3695ae7273593]:
#+begin_example
gpg (GnuPG) 2.4.0
libgcrypt 1.10.1
Copyright (C) 2021 Free Software Foundation, Inc.
License GNU GPL-3.0-or-later <https://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.

Home: /Users/jeffkreeftmeijer/.gnupg
Supported algorithms:
Pubkey: RSA, ELG, DSA, ECDH, ECDSA, EDDSA
Cipher: IDEA, 3DES, CAST5, BLOWFISH, AES, AES192, AES256, TWOFISH,
        CAMELLIA128, CAMELLIA192, CAMELLIA256
Hash: SHA1, RIPEMD160, SHA256, SHA384, SHA512, SHA224
Compression: Uncompressed, ZIP, ZLIB, BZIP2
#+end_example

** tmux

#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports both
#+begin_src shell
  tmux -V
#+end_src

#+RESULTS[d890824c56ae02ca54fbf0eb2e021e0279769f76]:
: tmux 3.3a

** zsh

#+headers: :cache yes
#+headers: :eval yes
#+headers: :exports both
#+begin_src shell
  zsh --version
#+end_src

#+RESULTS[e99f22e09a686ab11189774093997dc75be3d5a7]:
: zsh 5.9 (x86_64-apple-darwin22.3.0)

